
&После("ПослеЗаписиНаСервере")
Процедура C6_ПослеЗаписиНаСервере(Форма)
	Если (Форма.Элементы.Найти("КнопкаC6_СБППолучитьQRКод") <> Неопределено) Тогда
		Форма.Элементы.КнопкаC6_СБППолучитьQRКод.Доступность = Истина;
		Форма.Элементы.КнопкаC6_СБПСтатусОплаты.Доступность = Истина;
	ИначеЕсли (Форма.Элементы.Найти("КнопкаC6_СБПЗапроситьВозврат") <> Неопределено) Тогда
		Форма.Элементы.КнопкаC6_СБПЗапроситьВозврат.Доступность = Истина;
		Форма.Элементы.КнопкаC6_СБПСтатусВозврата.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры
