
&После("ПриСозданииНаСервере")
Процедура C6_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)
	Перем Параметры, ТекОбъект;
	Перем Доступность, НоваяКнопка;
	Если (НЕ Отказ) Тогда
		Параметры = Форма.Параметры;
		Если (Параметры.Свойство("Ключ") <> 0) Тогда
			ТекОбъект = Параметры.Ключ; //не удается поймать здесь тип, когда новый то нетипизировано
			//Если (ТипЗнч(ТекОбъект) = Тип("ДокументСсылка.ЧекККМ")) Тогда
			Если (Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокумента") Тогда
				Доступность = (НЕ ТекОбъект.Пустая()); // ссылочный тип
				//Если (ТекОбъект.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Продажа) Тогда
				Если (Форма.Объект.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Продажа) Тогда
					НоваяКнопка = C6_ОбщиеСервер.Форма_ДобавитьКнопку(Форма, "C6_СБППолучитьQRКод", "QR-код", Форма.Элементы.ГруппаКнопкиEmailSms);
					НоваяКнопка.Доступность = Доступность;
					НоваяКнопка = C6_ОбщиеСервер.Форма_ДобавитьКнопку(Форма, "C6_СБПСтатусОплаты", "Статус QR-кода", Форма.Элементы.ГруппаКнопкиEmailSms);
					НоваяКнопка.Доступность = Доступность;
				//ИначеЕсли (ТекОбъект.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат) Тогда
				ИначеЕсли (Форма.Объект.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат) Тогда
					НоваяКнопка = C6_ОбщиеСервер.Форма_ДобавитьКнопку(Форма, "C6_СБПЗапроситьВозврат", "Возврат", Форма.Элементы.ГруппаКнопкиEmailSms);
					НоваяКнопка.Доступность = Доступность;
					НоваяКнопка = C6_ОбщиеСервер.Форма_ДобавитьКнопку(Форма, "C6_СБПСтатусВозврата", "Статус возврата", Форма.Элементы.ГруппаКнопкиEmailSms);
					НоваяКнопка.Доступность = Доступность;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
