// (c) 2021 C6 Lab, Ramona Orlova, http://c6lab.org
// Все права сохранены.
////////////////////////////////////////////////////////////////////////////////

//
Функция ПолучитьОбщийМакетНаСервере(ИмяМакета) Экспорт
	// преодолеваем кэширование на сервере
	// если получать просто по имени макета, то будет кэшированный zip-файл
	Возврат ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет(СтрЗаменить(ИмяМакета, "ОбщийМакет.", "")));
КонецФункции

//
Функция ПолучитьТипКлиента() Экспорт
	Возврат ПредставлениеПриложения(ПолучитьТекущийСеансИнформационнойБазы().ИмяПриложения);
КонецФункции
