// (c) 2021 C6 Lab, Ramona Orlova, http://c6lab.org
// Все права сохранены.
////////////////////////////////////////////////////////////////////////////////

Функция ОтключитьКонтрольОстатковПриПроведении(Знач Выключить = Истина) Экспорт
	Перем Рез;
	Перем Менеджер;
	Если (ТипЗнч(Выключить) <> Тип("Булево")) Тогда
		Возврат Ложь;
	КонецЕсли;
	Рез = Ложь;
	Попытка
		Менеджер = РегистрыСведений.ЗначенияДополнительныхПравПользователя.СоздатьМенеджерЗаписи();
		Менеджер.Право = ПланыВидовХарактеристик.ПраваПользователей.КонтролироватьОстатокПриПроведении;
		Менеджер.Пользователь = Пользователи.ТекущийПользователь();
		//Менеджер.Прочитать();
		Менеджер.Значение = НЕ Выключить;
		Менеджер.Записать(Истина);
		Рез = Истина;
	Исключение
		//Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Возврат Рез;
КонецФункции

Функция Форма_ДобавитьКнопку(КонтФормы, Знач Действие, Знач Заголовок, Родитель) Экспорт
	Перем НоваяКоманда;
	Перем НоваяКнопка;
	
	НоваяКоманда = КонтФормы.Команды.Добавить(Действие);
	НоваяКоманда.Действие = "Подключаемый_ВыполнитьКоманду";
	НоваяКоманда.Заголовок = Заголовок; 
	
	НоваяКнопка = КонтФормы.Элементы.Добавить("Кнопка" + Действие, Тип("КнопкаФормы"), Родитель); 
	НоваяКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопка.ИмяКоманды = Действие;
	
	Возврат НоваяКнопка;
КонецФункции
