// (c) 2021 C6 Lab, Ramona Orlova, http://c6lab.org
// Все права сохранены.
////////////////////////////////////////////////////////////////////////////////

//
Функция ОбработкаУведомленияСтатусаПлатежа(Запрос, СтруктураУведомления) Экспорт
	Перем Ответ, СтрокаДляОтвета;
	// Уведомление считается принятым, если получатель ответил на запрос кодом HTTP 200.
	Ответ = Новый HTTPСервисОтвет(200);
	СтрокаДляОтвета = "OK";
	Ответ.Заголовки.Вставить("Content-type", "application/JSON; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;
КонецФункции
