// (c) 2021 C6 Lab, Ramona Orlova, http://c6lab.org
// Все права сохранены.
////////////////////////////////////////////////////////////////////////////////

//
Функция Доступен() Экспорт
	Перем Рез;
	Перем Тест;
	//УдалитьДрайвер();
	Попытка
		Тест = Новый("AddIn.C6DisplayQR.ComUtil");
		Рез = Истина;
	Исключение
		Рез = ЗагрузитьДрайвер();
		Если (Рез) Тогда
			Тест = Новый("AddIn.C6DisplayQR.ComUtil");
			Рез = Истина;
		КонецЕсли;
	КонецПопытки;
	Возврат Рез;
КонецФункции

//*
Функция ПоказатьКод(Знач СтрЗначение) Экспорт
	Перем Рез;
	Перем Дисплей;
	Рез = Ложь;
	//Сообщить("QRДисплей: " + СокрЛП(СтрЗначение));
	Если (Доступен()) Тогда
		Попытка
			Дисплей = Новый("AddIn.C6DisplayQR.ComUtil");
			Дисплей.ИмяПорта = C6_СБПВызовСервера.НастройкиИмяПорта();
			Если (Дисплей.ОткрытьПорт()) Тогда
				Дисплей.ОтправитьQRКод(СокрЛП(СтрЗначение));
				Дисплей.ЗакрытьПорт();
				Рез = Истина;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	Возврат Рез;
КонецФункции

//*
Функция ПоказатьРекламу() Экспорт
	Возврат ПоказатьКод("http://tln.spb.ru/");
КонецФункции

//
Функция Очистить() Экспорт
	// только с новой прошивкой (!)
	Возврат Ложь;
КонецФункции

//
Функция УдалитьДрайвер() Экспорт
	Перем WSH, AppData;
	WSH = Новый COMobject("wscript.shell");
	AppData = WSH.ExpandEnvironmentStrings("%AppData%");
	УдалитьФайлы(AppData + "\1C\1cv8\ExtCompT\C6DisplayQR.dll");
КонецФункции

//
Функция ЗагрузитьДрайвер()
	Перем Рез;
	Перем СисИнфо, ИмяМакета;
	Рез = Ложь;
	СисИнфо = Новый СистемнаяИнформация;
	ИмяМакета = ?((СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86), "ОбщийМакет.C6_ДрайверQRДисплея32",
				//?((СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64), "ОбщийМакет.C6_ДрайверQRДисплея64", ""));
				"");
	Если (ПустаяСтрока(ИмяМакета)) Тогда
		Сообщить("[C6DisplayQR] Не поддерживается платформа " + C6_QRДисплейВызовСервера.ПолучитьТипКлиента() + " " + СисИнфо.ТипПлатформы);
		Возврат Ложь;
	КонецЕсли;
	Пока (Истина = Истина) Цикл
		ИмяМакета = C6_QRДисплейВызовСервера.ПолучитьОбщийМакетНаСервере(ИмяМакета); // борьба с кэшированием zip-а на сервере
		Рез = ПодключитьВнешнююКомпоненту(ИмяМакета, "C6DisplayQR", ТипВнешнейКомпоненты.Native);
#Если ТонкийКлиент ИЛИ ВебКлиент Тогда
		Если (Рез) Тогда
			Прервать;
		КонецЕсли;
		УстановитьВнешнююКомпоненту(ИмяМакета);
		Рез = ПодключитьВнешнююКомпоненту(ИмяМакета, "C6DisplayQR", ТипВнешнейКомпоненты.Native);
#КонецЕсли
		Прервать;
	КонецЦикла;
	Возврат Рез;
КонецФункции
