
&Вместо("ВыполнитьКоманду")
Процедура C6_ВыполнитьКоманду(Форма, Команда, Источник)
	Если (Лев(Команда.Имя, 3) = "C6_") Тогда
		Если (Команда.Имя = "C6_СБППолучитьQRКод") Тогда
			C6_СБПКлиент.Команда_СБППолучитьQRКод(Форма, Источник);
		ИначеЕсли (Команда.Имя = "C6_СБПСтатусОплаты") Тогда
			C6_СБПКлиент.Команда_СБПСтатусОплаты(Форма, Источник);
		ИначеЕсли (Команда.Имя = "C6_СБПЗапроситьВозврат") Тогда
			C6_СБПКлиент.Команда_СБПЗапроситьВозврат(Форма, Источник);
		ИначеЕсли (Команда.Имя = "C6_СБПСтатусВозврата") Тогда
			C6_СБПКлиент.Команда_СБПСтатусВозврата(Форма, Источник);
		КонецЕсли;
	Иначе
		ПродолжитьВызов(Форма, Команда, Источник);
	КонецЕсли;
КонецПроцедуры

&После("НачатьОбновлениеКоманд")
Процедура C6_НачатьОбновлениеКоманд(Форма)
	Если (Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокумента") Тогда
		//C6_QRДисплей.ПоказатьРекламу();
		//уберу, пока тормозит вывод, чтобы не тормозило открытие чека
	КонецЕсли;
КонецПроцедуры
